Repository: sonoUnoTeam/sonoUno-web
Catalog: web/src/i18n/messages.xlf
Languages: es_ar

source: This functionality allows the user to erase the last mark made with the mark point element. It’s useful when the user has made a mark without intention or the place is incorrect. The button is placed beneath the graph, it’s the fourth button, next to the mark point button (Image 27).
es_ar: Esta funcionalidad le permite al usuario borrar el ultimo marcador añadido con el botón de "Añadir marcador". Es útil cuando el usuario ha añadido un marcador por error o el lugar no es el indicado. El botón está ubicado debajo del gráfico. Es el cuarto botón desde la izquierda. (Imagen 27).

source: IMAGE 35 A SLIDER ALLOWS TO MODIFY THE FREQUENCY
es_ar: IMAGEN 35 UN SLIDER PERMITE MODIFICAR LA FRECUENCIA.

source: IMAGE 36 A SLIDER ALLOWS TO MODIFY THE VOLUME OF THE SOUND AND THE SOUND TYPE
es_ar: IMAGEN 36 UN SLIDER PERMITE MODIFICAR EL VOLUMEN DEL SONIDO Y EL TIPO DE SONIDO

source: Another way to erase the last mark point is with the shortcut key ‘Shift+D’.
es_ar: Otra manera de borrar el último marcador es con el atajo "Shift+D".

source: IMAGE 37 ADVANCED SOUND CONFIGURATION
es_ar: IMAGEN 37 CONFIGURACIÓN DE SONIDO AVANZADA

source: 7. Plot and Sound Configurations
es_ar: 7. Configuraciones del gráfico y el sonido

source: IMAGE 38 SHOWS THE BASIC PLOT CONFIGURATION SECTION
es_ar: IMAGEN 38 MUESTRA LA CONFIGURACIÓN BÁSICA DEL GRÁFICO

source: SonoUno web allows the user to adjust some sound and plot settings,these options are at the bottom of the page (Image 28).
es_ar: SonoUno web permite al usuario hacer algunos ajustes al sonido y al gráfico, estas opciones están en la parte inferior de la página (Imagen 28).

source: IMAGE 39 THE STYLE SECTION OF THE PLOT CONFIGURATION COUNTS WITH THREE COMBO BOXES THAT ALLOWS USERS TO SELECT FROM A LIST OF DIFFERENT OPTIONS TO MODIFY THE WAY THE GRAPH LOOKS.
es_ar: IMAGEN 39 LA SECCIÓN DE LA CONFIGURACIÓN DE ESTILO CUENTA CON TRES CAJAS DESPLEGABLES QUE LE PERMITEN AL USUARIO ELEGIR DE UNA LISTA DE DIFERENTES OPCIONES PARA MODIFICAR LA MANERA EN LA QUE EL GRÁFICO LUCE.

source: IMAGE 40 THE LINE STYLE ELEMENT IS A DROP-DOWN LIST WITH FOUR DIFFERENT STYLES.IN THE IMAGE THE DASH-DOT LINE OPTION IS SELECTED.
es_ar: IMAGEN 40 EL ELEMENTO DE ESTILO DE LÍNEA ES UN CUADRO DESPLEGABLE CON LOS CUATRO ESTILOS DE LÍNEA. EN LA IMAGEN EL ESTILO GUIÓN-PUNTO ES EL ELEGIDO.

source: 7.1. Sound configuration
es_ar: 7.1 Configuración de sonido

source: IMAGE 41 THE MARKER STYLE ELEMENT IS A DROP-DOWN LIST, WHERE THERE ARE DIFFERENT OPTIONS. IN THE IMAGE THE DIAMOND MARKER STYLE IS SELECTED.
es_ar: IMAGEN 41 EL ELEMENTO ESTILO DEL MARCADOR ES UNA CAJA DESPLEGABLE, DONDE HAY DIFERENTES OPCIONES. EN LA IMAGEN EL ESTILO DE MARCADOR DIAMANTE ES EL SELECCIONADO.

source: The location of the sound configurations is on the bottom left of the page
es_ar: La configuración de sonido se encuentra ubicado en la zona inferior izquierda de la página.

source: The sound configuration can be divided into 3 distincts parts.
es_ar: La configuración de sonido está dividida en 3 partes bien diferenciadas

source: IMAGE 42 THE COLOR STYLE ELEMENT IS A DROP-DOWN LIST, WHERE THERE ARE SEVEN OPTIONS. IN THE IMAGE THE ORANGE COLOR STYLE IS SELECTED. IN ADDITION, THE DOTTED LINE STYLE AND CIRCLE MARKER HAVE BEEN CHOSEN.
es_ar: IMAGEN 42 EL ELEMENTO DE COLOR DE ESTILO ES UNA CAJA DESPLEGABLE, DONDE HAY 7 OPCIONES. EN LA IMAGEN EL ESTILO DE COLOR NARANJA ES EL SELECCIONADO. EN ADICIÓN A ESO EL ESTILO PUNTEADO Y EL MARCADOR CIRCULAR HA SIDO SELECCIONADO.

source: frequency range and sound types selection (Image 29),
es_ar: selección de frecuencia rango y tipo de sonidos (Imagen 29),

source: IMAGE 43 PLOT AND AXES NAMES
es_ar: IMAGEN 43 NOMBRES DE GRÁFICO Y EJES

source: volume and buttons to set logarithmic scale and continuous sound (Image 30),
es_ar: volumen y los botones para activar la escala logarítmica y el sonido continuo (imagen 30),

source: IMAGE 44 NEW COLOR AND PLOT AND AXES NAMES
es_ar: IMAGEN 44 NUEVO COLOR Y LOS NOMBRES DEL GRÁFICO Y EJES

source: advanced functions configuration, which includes the logarithmic scale, discrete or continuous sound and envelop (Image 31)
es_ar: configuración de las funciones avanzadas, que incluye el botón de escala logarítmica, sonido continuo o discreto y el filtro envolvente (Imagen 31)

source: IMAGE 45 PREDEFINED MATHEMATICAL FUNCTIONS
es_ar: IMAGEN 45 FUNCIONES MATEMÁTICAS PREDEFINIDAS.

source: IMAGE 46 MODAL WINDOW WITH THE PEAK FINDER SETTINGS
es_ar: IMAGEN 46 VENTANA MODAL CON LAS OPCIONES DE LA DETECCIÓN DE PICOS

source: A checkbox allows for the selection of frequency mapping and the two sliders beneath it modify the minimum and maximum frequency used in the variable mapping.
es_ar: Un checkbox que permite la selección de un rango del mapeo del rango de frecuencias con dos sliders debajo para modificar la frecuencia mínima y máxima.

source: List of Tables
es_ar: Lista de Tablas

source: The next combo box, with a list, allows the user to choose between some sound types to use. These sounds are not intended to sound like real instruments, but rather just loosely recall those instrument’s sounds in order to present the user with some distinguishable options.
es_ar: El siguiente menú desplegable, con una lista, permite al usuario elegir entre algunos tipos de sonido para usar. Estos sonidos no pretenden sonar como el instrumento de la vida real, sino recordar vagamente el sonido de esos instrumentos para que el usuario tenga algunas opciones diferenciables entre sí.

source: Table 1
es_ar: Tabla 1

source: TERMINOLOGY
es_ar: TERMINOLOGÍA

source: The Advanced Sound Configurations includes the configuration of envelope filters (Image 31). A checkbox is used to enable and disable the filter. After checking it you can use the attack, decay, sustain and release sliders to modify the resulting sound.
es_ar: La "Configuración de sonido avanzada" incluye la configuración del filtro envolvente (Imagen 31). Un checkbox que permite habilitar o deshabilitar el filtro. Después de activarlo se pueden usar los sliders de ataque, decaimiento, sostenimiento y relajamiento para modificar el sonido resultante.

source: Terminology/Acronym
es_ar: Terminología/Acrónimos

source: Description
es_ar: Descripción

source: NOTE: All the sliders inside the mapping configuration must be enabled and disabled with check boxes, this is to ensure a better navigation with the screen reader and a lower memory overload.
es_ar: NOTA: Todos los sliders dentro del mapeo de configuración deben ser activados y desactivados con los checkboxes, esto es para asegurar una mejor navegación con los lectores de pantalla y una menor carga en la memoria.

source: Centre National De La Recherche Scientifique
es_ar: Centre National De la Reserche Scientifique

source: 7.2. Plot configurations
es_ar: 7.2. Configuraciones del gráfico

source: Coordination and Support Action
es_ar: Coordinantion and Support Action

source: The plot configurations are located on the bottom right of the page. This tool is divided in.
es_ar: La configuración del gráfico está ubicado en la sección inferior derecha de la pagina. Esta herramienta está dividida en:

source: basic: title of the plot, name of the axes (Image 32),
es_ar: básicas: titulo del gráfico, nombre de los ejes (Imagen 32),

source: advanced configurations: line, marker and color styles (Image 33):
es_ar: configuraciones avanzadas: estilos de linea, marcadores y color (Imagen 33):

source: If you wish, you can also change the titles of the different parts of the graph. These are simple text boxes with the name that is actually displayed and you can choose to edit the name that is displayed or erase and type a new one. (No need to type enter after modifying it.)
es_ar: Si deseas, puedes cambiar los títulos de las diferentes partes del gráfico. Para esto se trata de simples cajas de texto, con el nombre que está siendo representado actualmente en el gráfico, puedes elegir editar el nombre o borrarlo y tipear uno nuevo. (No hay necesidad de presionar "Enter" después de modificarlo).

source: 7.2.1. Styles of the data plot
es_ar: 7.2.1. Estilos del gráfico de datos

source: On the plot configuration panel, after the line style label, is placed the drop-down list box with five options of style, which are: solid line, dashed line, dash-dot line and dotted line. In the example of the Image 34 the dash-dot line style is shown, with blue color and without markers.
es_ar: En el panel de la configuración del gráfico, después de la etiqueta de estilo de linea, hay un menú desplegable con cinco opciones de estilo, que son: Linea solida, Linea de guiones, Guion-Punto, y linea punteada. En el ejemplo de la Imagen 34 el estilo de guion-punto es el elegido, en color azul y sin marcadores.

source: The marker style option works analogously to the “line style”. It’s found just below the line style and offers some marker options: X, Circle, Star and diamond.In the Image 35 is used the Diamond down marker, with the dotted line style.
es_ar: La opción de estilo de marcador funciona de manera análoga a la de "Estilo de linea". Se encuentra debajo de ésta y ofrece algunas opciones de marcador: X, circulo, estrella y diamante. En la imagen 35 se usa el estilo Diamante, con una linea punteada.

source: Next to the color style label, is placed the drop-down list with five colors: blue, orange, red, green and yellow.
es_ar: Siguiente a la etiqueta de estilo de color, se encuentra una lista desplegable con cinco colores, azul, naranja rojo, verde y amarillo.

source: 7.2.2. Modifying the titles.
es_ar: 7.2.2. Modificando los títulos.

source: To modify the title just edit the text inside the text box next to the label of the title you want to edit (Image 37). The changes apply immediately after every keystroke and there's no need to type “enter” after editing it (Image 38)
es_ar: Para modificar el título solo debes editar el texto dentro de la caja de texto que acompaña a la etiqueta del título que quieras modificar (Imagen 37). Los cambios se aplican inmediatamente luego de cada tecla presionada y no hay necesidad de teclear "enter" para confirmar la edición (imagen 38).

source: 8. Mathematical Functions
es_ar: 8. Funciones matemáticas

source: The last version of sonoUno web includes the possibility to apply predefined mathematical functions, such as logarithm, square and smooth (Image 39), to the data. It is the first approach to the next step, which will allow you to use any function
es_ar: La última versión de sonoUno web incluye la posibilidad de aplicar funciones matemáticas predeterminadas, tales como logarítmica, cuadrada y de suavizado (Imagen 39). Este es la primera aproximación hacia el siguiente paso, que te permitiría usar cualquier función.

source: 8.1 Peak finder
es_ar: 8.1 Detección de picos

source: This function allows you to mark the peaks in the graph. For the intents of this function a peak is defined by the value that is bigger than the previous and next values and that also checks with the condition of being above the average of the graph plus a value calculated by the spread between the highest and lowest value multiplied by the sensitivity percentage
es_ar: Esta función te permite marcar los picos en el gráfico. Para los fines de esta función un pico está definido como el valor que es más alto que el anterior y el siguiente valor y que cumple con la condición de estar por encima del promedio del gráfico, más un valor calculado por la extensión entre el valor más alto y el más bajo multiplicado por el porcentaje de sensibilidad.

source: The settings window counts with a sensitivity slider that you can set to the value that best works for the current data. A button for cleaning the peaks and a button to add them like markers on the graph. Once you have marked them on the graph you can previsualize the effects of the changes on the slider.
es_ar: La ventana de ajustes cuenta con un slider para la sensibilidad que puedes usar para elegir el valor que mejor te funcione con los datos actuales. Un botón para limpiar los picos y un botón para añadirlos como marcadores en el gráfico. Una vez que los tengas marcados en el gráfico puedes previsualizar los efectos con los cambios del slider.

source: For closing the modal window you can click the "Close" button on the bottom left, the X besides the title or you can press the Escape key on your keyboard
es_ar: Para cerrar la ventana modal puedes clickear en el botón de "Cerrar" en la esquina inferior izquierda, en la X contigua a tu titulo o puedes presionar la tecla "Escape" de tu teclado

source: 8.2 Logarithmic
es_ar: 8.2 Logarítmico

source: This function allows you to apply the common logarithmic to every value on the data set and updates the graph accordingly.
es_ar: Esta función te permite aplicar el logaritmo común para cada valor en el set de datos y actualiza el gráfico.

source: 8.3 Quadratic
es_ar: 8.3 Cuadrada

source: This function allows you to update every value in the data set with its square and update the graph.
es_ar: Esta función te permite actualizar cada valor en el set de datos con su cuadrado y actualiza el gráfico.

source: 1. Software description
es_ar: 1. Descripción del software

source: 8.4 Smooth
es_ar: 8.4 Suavizado

source: SonoUno is a sonification software for astronomical data presented on a table (txt or csv files). The software is being developed based on the study of other software (Sonification Sandbox, MathTrax and xSonify) and standards of accessibility like the ISO 9241-171:2008 (Guidance on software accessibility) and the Web Accessibility Initiative – Accessible Rich Internet Applications (WAI-ARIA) guidelines. In order to develop the first approach of a graphical user interface, we perform a theoretical framework based on bibliography of user cases, focused on blind and visually impa people.
es_ar: SonoUno es un software de sonificación para datos astronómicos presentados en un formato de tabla (archivos txt o csv). El software está siendo desarrollado basado en el estudio de otros softwares (Sonification Sandbox, MathTrax and xSonify) y los estándares de accesibilidad como la ISO 9241-171:2008 (Guía para software accesible) y los lineamientos de la Web Accessibility Initiative – Accessible Rich Internet Applications (WAI-ARIA) . En el desarrollo de la primer aproximación a la interfaz gráfica de usuario, se realizó un framework teórico basado en bibliografía de casos de usuario, enfocandose en ciegos y personas con impedimentos visuales.

source: This function allows you to use a moving average data smoothing with the gate value indicating the average of how many values are used. By this you mitigate the impacts of short fluctuations.
es_ar: Esta función te permite usar la media móvil para suavizar con el valor de la ventana indicando la media de cuantos valores es usada. De esta manera reduces el impacto de fluctuaciones cortas.

source: The development framework is Angular which promotes modularity, in order to do collaborative work. Being this version of SonoUno web based, is accessible from nearly any platform; the development team worked with this aim in mind. The main goal of SonoUno is to allow the user to open data files (txt or csv extension), show the plot and sonify the data. At the moment, the sonification is performed by variation of pitch and the sonification settings allow to change the volume and the timbre.
es_ar: El framework de desarrollo es Angular, que promueve la modularidad, lo que facilita el trabajo colaborativo. Esta versión de SonoUno siendo basada en la web es accesible desde casi cualquier plataforma; el equipo de desarrollo trabajó con este objetivo en mente. El objetivo principal de Sonouno es permitir al usuario abrir archivos de datos (con extenciones txt o csv), mostrar el gráfico y la sonificación de los datos. En este momento, la sonificación es llevada a cabo por la variación de tono y las opciones de sonificación permiten modificar el volumen y el timbre.

source: Additionally, SonoUno allows users to select a specific range of data on the ‘x’ axis, mark and save points of interest in the data, apply predefined mathematical functions (for example, logarithm and square) and manipulate the data arrays with an Octave interface. In the settings section, the user can configure the plot and some features of the sound.
es_ar: Adicionalmente, SonoUno permite a los usuarios seleccionar rangos específicos de datos en el eje "X", añadir y guardar puntos de interes en los datos, aplicar funciones matemáticas predefinidas (por ejemplo, logarítmica y cuadrada) y manipular las listas de datos con una interfaz de Octave. En la sección de las configuraciones, el usuario puede configurar el gráfico y algunas características del sonido.

source: Finally, the software allows the user to save the plot, a text file with the points marked on the data and a csv file with the plotted data.
es_ar: Finalmente, el software permite al usuario guardar el gráfico, un archivo de texto con los puntos marcados y un archivo csv con los datos graficados.

source: 2. Opening the software
es_ar: 2. Abriendo el software

source: Being a web based application accessing to sonoUno it’s as easy as to type the url on your preferred browser:
es_ar: Siendo basado en la web acceder a sonoUno es tan sencillo como escribir la url en su explorador de preferencia.

source: This link opens the landing page for the web version of sonoUno
es_ar: Este link abre la página de inicio de sonoUno

source: Angular’s support extends to the latest Edge, Firefox, Chrome and Safari versions, so it’s advised to update your browser. (Image 1). If after entering the URL you don’t get the sonoUno’s homepage first check:
es_ar: El soporte de Angular se extiende hasta las últimas versiones de Edge, Firefox, Chrome y Safari, por eso es aconsejable que actualices tu navegador. (Imagen 1). Si luego de acceder a la URL no puedes ingresar a la pagina de inicio, primero checkea:

source: Check that you have typed the correct url.
es_ar: Asegurate de que la url es la correcta.

source: Check your network connection and access to the internet.
es_ar: Asegurate de tener una conexión a internet.

source: If after that you still can’t establish a connection send a message to the development team via e-mail:
es_ar: Si a pesar de todo eso no puedes acceder, por favor comunicate con el equipo de desarrolo por e-mail:

source: At the landing page it is possible to select between HOME and QUICK START and also decide if not to show this page again.
es_ar: En la pagina de inicio puedes elegir entre HOME y Guia de inicio rápido, también puedes optar por no volver a ver esa pantalla y acceder directamente al HOME.

source: 2.1. QUICK START Guide
es_ar: 2.1. Guía de inicio rápido

source: The recommendation is for the new users to go first to the QUICK START (Figure 2), where a short explanation of each section of the web interface (on the screen) and functionalities settings by default are detailed.
es_ar: La recomendación para usuarios nuevos es que primero se dirijan a la Guía de inicio rápido (Figura 2), donde hay una corta explicación de cada sección de la interfaz web de sonoUno (en la pantalla) y funcionalidades y configuraciones por determinado son detalladas.

source: 2.2. Home page
es_ar: 2.2 Página de inicio

source: The home page of sonoUno greets you with four distinct sections:
es_ar: La página de inicio de sonoUno tiene cuatro secciones distintivas:

source: The navigation bar with the access to the File functionalities; Input/Output functions, Sample data and the access to the Help and the Quickstart guides. This design was based on a user case study (Image 3)
es_ar: La barra de navegación con el acceso alas funcionalidades de archivo: Entrada/Salida, datos de ejemplo y botones para el acceso a la Ayuda y a la guía de inicio rápido. Este diseño fue basado en un estudio de casos de usuario (Imagen 3).

source: The graph has four buttons to control “Play/Pause”, “Stop”, “Mark Point” and “Delete Mark” and two sliders to control the abscissa position and the tempo (Image 4).
es_ar: El gráfico tiene cuatro botones para controlar "Play/Pausa", "Stop" "Añadir Marcador" y "Eliminar Marcador" y también dos sliders para controlar la posición en el eje de abscissas y el tempo. (Imagen 4).

source: Below the sliders, a MathFunctions bar permits selecting between simple mathematical functions to apply to the data (Image 4)
es_ar: Debajo de los sliders, una barra de funciones matemáticas permite seleccionar entre algunas funciones matemáticas simples para aplicar a los datos ingresados. (Imagen 4).

source: The sound configuration section has the tools to modify the way audio is processed, if you press on this button you will see all the Sound configuration options (Image 5).
es_ar: La sección de configuraciones de sonido tiene las herramientas para modificar la manera en la que el audio se procesa, si se presiona en este botón de desplegarán las opciones de Configuración de Sonido (Imagen 5).

source: The plot configuration section allows you to modify the way the data is displayed in the graph, if you press on this button you will see all the Plot configuration options (Image 6).
es_ar: La sección de la configuración del gráfico te permite modificar la manera en la que los datos son representados en el gráfico, si presionas este botón te desplegará las opciones de Configuración del gráfico (Imagen 6).

source: Every section will be explained in detail in further chapters of this help guide.
es_ar: Cada sección será explicada en detalle en futuros capítulos de esta guía de ayuda.

source: 2.3. Testing sonoUno web
es_ar: 2.3 Probando sonoUno web

source: You can start testing the SonoUno functionalities with the sample data that's provided under the dropdown menu “Sample Data”. Just select any of the options under this menu to get the data (Image 7) automatically loaded on your graph area and the audio be ready to play.
es_ar: Puedes comenzar a probar las funcionalidades de sonoUno con los datos de muestra que se encuentran en el menú desplegable "Datos de muestra". Solo selecciona cualquiera de los items en este menú para obtener los datos (Imagen 7) y que automáticamente sean cargados en el área del gráfico y el sonido esté listo para reproducirse.

source: In order to listen to the graph just press the button “Play” under the graph. You should see an orange bar moving from left to right indicating the progress on the data being played and hear the pitch variations matching the data.
es_ar: Para poder escuchar el gráfico solo tienes que presionar el botón "Play" debajo del gráfico. Deberías de ver una barra naranja moviendose de izquierda a derecha indicando el avance en los datos siendo reproducidos y oír las variaciones de tono acompañando el gráfico.

source: If you can see the black bar moving but still no sound comes out from your headphones or speakers:
es_ar: Si puedes ver la barra negra moviéndose pero no obtienes sonido de tus auriculares o parlantes:

source: Check your speakers or headphones connection to your PC.
es_ar: Verifica que tus parlantes o auriculares estén conectados correctamente a tu PC.

source: Check your sound configuration: volume level and mute.
es_ar: Verifica las configuraciones de audio de tu PC: nivel de volumen y silencio (mute).

source: Check if your browser has blocked the sound reproduction and that the tab is not muted.
es_ar: Verifica que tu explorador no ha bloqueado la reproducción de sonido y que la pestaña no esté muteada.

source: If the problems continue or you have another problem, please inform this to the developer team.
es_ar: Si el problema persiste o tienes algún otro problema, por favor comuníquese con el equipo de desarrollo:

source: 2.4. Things to keep in mind
es_ar: 2.4 Cosas a tener en cuenta
