Repository: sonoUnoTeam/sonoUno-web
Catalog: web/src/i18n/messages.xlf
Languages: es_ar

source: Some widgets, like warnings or confirmation buttons may be in your browser configured language. Otherwise, the software language is always English. In the future the team is looking forward to unifying the languages.
es_ar: Algunos widgets, como advertencias o botones de confirmación puede que estén en el idioma predeterminado de tu navegador. Fuera de eso el software siempre estará en inglés. En el futuro el equipo busca unificar los idiomas.

source: In the files to import the first column must have continuous values, it is used as a coordinate dependent axis.
es_ar: El archivo a importar en su primer columna debe tener valores continuos, es usado como un eje de coordenadas dependientes.

source: All screenshots and images shown are for illustration purposes only, the real image can change a little depending on the web browser.
es_ar: Todas las capturas de pantallas e imágenes mostradas son de carácter ilustrativo, la apariencia real puede variar un poco dependiendo del navegador.

source: 3.0. Opening a file
es_ar: 3.0 Abriendo un archivo

source: You can open files for three different reasons, you can open a csv with data to be displayed and played by sonouno, you could add a wav file to get the data from its envelope or you could add markers that you have previously saved for that data set.
es_ar: Puedes abrir archivos por 3 razones diferentes, puedes abrir un archivo CSV con datos para ser representados y reproducidos por sonoUno, puedes abrir un archivo wav para extraer datos de su envolvente, o puedes abrir un archivo de marcadores que hayas exportado previamente para ese set de datos.

source: To open a .csv or .txt file with a new data set, you can use the option "Data CSV” under the Input dropdown menu (Image 8). This action will open a pop-up window with your operating system’s file explorer (Image 9), where you can search and open any data file.
es_ar: Para abrir un archivo .csv o .txt con un nuevo set de datos, puedes usar la opción "CSV de Datos" debajo de la caja desplegable de Entrada en el menú (Imagen 8). Esta acción abrirá una ventana pop-up con el explorador de archivos de tu sistema operativo (Imagen 9), donde puedes buscar y abrir cualquier archivo de datos.

source: When you have the data file selected, press the button Open or the Enter key. The sonoUno will generate the graph (Image 10) and update the abscissa’s slide bar. Everything is ready, pressing the “Play” button should start the reproduction.
es_ar: Cuando tienes el archivo de datos seleccionado, presiona "Abrir" o la tecla Enter. SonoUno generará el gráfico (Imagen 10) y actualizará el slider de posición en abscisas. Todo está listo, presionar el botón de "Play" debería comenzar la reproducción.

source: 3.2. Opening a WAV file
es_ar: 3.2. Abriendo un archivo WAV

source: You can open a wav file and get the dataset from its envelope. You can access the functionality under the Input dropdown Menu, and just like in the CSV file, the system file browser will pop up and you'll be able to select the file and load it.
es_ar: Puedes abrir un archivo wav y conseguir tu nuevo set de datos de su envolvente. Puedes acceder a esta funcionalidad debajo del menú desplegable de entrada, y de la misma manera que con un archivo CSV, el explorador de archivos se abrirá y serás capaz de seleccionar el archivo y cargarlo.

source: A .wav file has a sampling rate, defined by the amount of values recorded in a second, by now we are calculating the envelope values by the square root of the average of a set amount of values. In the near future we will be adding the possibility of modifying the gate of values for that average, until then it's set to 5.
es_ar: Un archivo .wav tiene una frecuencia de muestreo, definida por la cantidad de valores grabados por segundo, por ahora calculamos los valores de la envolvente por la raíz cuadrada de la media móvil de una cantidad de datos predeterminada. En el futuro cercano, vamos a añadir la posibilidad de modificar los valores de ventana para esa media, hasta entonces el valor es 5.

source: After uploading the wav file, the envelope of the file will be loaded to the graph as a . Everything is ready, pressing the “Play” button should start the reproduction.
es_ar: Después de añadir el archivo wav, la envolvente de el archivo va a ser cargada al gráfico. Después de eso todo está listo y si presionas el botón de "Play" la reproducción debería comenzar

source: 3.3. Opening a markers saved file
es_ar: 3.3. Abriendo un archivo de marcadores guardados

source: You can easily export the list of markers that you add to your given data set via the export markers option, now we will talk about how you can easily import that saved data to apply it again to the data set. You can access the functionality under the Input dropdown Menu, and after clicking in the Markers CSV option you can import the file that you have saved. As it's the web version of SonoUno it will most likely be on your Downloads folder.
es_ar: Puedes exportar fácilmente la lista de marcadores que tu has añadido a un set de datos determinado por medio de la opción "exportar marcadores", ahora vamos a hablar de como puedes importar esos marcadores guardados para aplicarlos nuevamente al set de datos. Puedes acceder a esta funcionalidad desde el menú desplegable "Entrada", y luego clickear en el item "Marcadores CSV" para cargar el archivo que has guardado. Como es la versión web de sonoUno lo más normal sería encontrarlo en la carpetescargas.

source: After loading the markers the graph should be updated with the list of markers that you have uploaded, in this case we have only three but you can save and later import as many as you want. It's important to insist that this functionality should be used with the data set where the markers taken, the points of the graph are saved in absolute numbers and not relative to their positions on the plot, loading the markers on another data set with a different range or functions could result in errors and most certainly in failures and unexpected behaviors.
es_ar: Después de cargar los marcadores el gráfico debería de actualizarse con la lista de marcadores que has cargado, en este caso tenemos solamente tres pero tu puedes guardar y luego importar tantos como quieras. Es importante insistir en que esta funcionalidad debe de ser usada con el set de datos de donde los marcadores fueron sacados, los puntos del gráfico son guardado es en términos absolutos y no relativos a la posición en el gráfico, cargar los marcadores de otro set de datos con otro rango o funciones puede resultar en errores y casi seguramente en fallos y comportamientos no esperados.

source: 3.4. Mark and Delete all marks button
es_ar: 3.4 Botones para añadir y eliminar marcadores.

source: Before starting with this functionality, we must explain that the sonoUno allows the user to mark points of interest on the data, and store the coordinates on a vector or file. These marks are shown with a diverse amount of user selectable symbols over the plot (Image 11).
es_ar: Antes de comenzar con esta funcionalidad, debemos explicar que sonoUno le permite al usuario marcar puntos de interés en los datos y guardar los datos en un archivo o array. Estos marcadores son mostrados con una diversa cantidad de símbolos sobre el gráfico (Imagen 11).

source: The functionality of the “Delete Mark” button placed under the graph (Image11), is to erase the last added mark point on the data.
es_ar: La funcionalidad del botón "Eliminar marcador" ubicado debajo del gráfico (Imagen 11), es borrar el último marcador añadido a los datos.

source: 4. Save files
es_ar: 4. Guardar archivos

source: There are two ways to save files
es_ar: Hay dos maneras de guardar archivos:

source: In the dropdown menu, the option “Output” deploys the list of options to save: Sound, Marked Points, Plot (from top to bottom) (Image 12). <div class="border"><img class='achicar' src="/assets/images/imagen12.png" alt="image" /></div><p class="epigrafe">Image 12 Displays the sonoUno interface with an opened data file. At the top Menu, the Output button displays the Save Sound, Save Markers , Save Plot possibilities. </p>
es_ar: En el menú desplegable de Salida se muestran las opciones para guardar: audio, marcadores, y el gráfico (Desde arriba a abajo) (Imagen 12).<div class="border"><img class='achicar' src="/assets/images/imagen12.png" alt="image" /></div><p class="epigrafe">Imagen 12 Muestra la interfaz de sonoUno con un archivo de datos abierto. En la barra de navegación, el menú desplegable de salida muestra las opciones Guardar Audio, Guardar Marcadores, y Guardar Gráfico. </p>

source: QUICKSTART
es_ar: GUÍA INICIO RÁPIDO

source: Project Title
es_ar: Titulo del projecto

source: Project Acronym
es_ar: Acrónimo del proyecto

source: Start Date of Project
es_ar: Fecha de comienzo del proyecto

source: Duration of Project
es_ar: Duración del proyecto

source: 36 Months
es_ar: 36 Meses

source: Project Website
es_ar: Sitio web del proyecto

source: User Manual: Printable version
es_ar: Manual del usuario: Versión imprimible

source: Printable version
es_ar: Versión imprimible

source: <button type="button" class="btn-sonouno ml-4"><a href="./assets/REINFORCE - D7.1 - Sonification Platform and Training Courses v1.pdf" download> Download PDF</a></button>
es_ar: <button type="button" class="btn-sonouno ml-4"><a href="./assets/REINFORCE - D7.1 - Sonification Platform and Training Courses v1.pdf" download> Descargar PDF</a></button>

source: <span style="text-decoration: underline">D</span>ELETE MARK
es_ar: <span style="text-decoration: underline">E</span>liminar marcador

source: <span style="text-decoration: underline">R</span>ESET PLOT RANGE
es_ar: <span style="text-decoration: underline">R</span>einiciar rango del gráfico

source: ABSCISSA POSITION
es_ar: POSICIÓN DE ABSCISAS

source: MATH FUNCTIONS
es_ar: FUNCIONES MATEMÁTICAS

source: PEAK FINDER
es_ar: DETECCIÓN DE PICOS

source: LOGARITHMIC
es_ar: LOGARÍTMICA

source: QUADRATIC
es_ar: CUADRATICA

source: SMOOTH
es_ar: SUAVIZADO

source: SET MAX FREQUENCY
es_ar: SETEAR FRECUENCIA MÁXIMA

source: SMOOTH GATE
es_ar: VENTANA DEL SUAVIZA

source: Volume
es_ar: Volumen

source: SOUND CONFIGURATION
es_ar: CONFIGURACIÓN DEL SONIDO

source: SELECT SOUND TYPE
es_ar: SELECCIONAR TIPO DE SONIDO

source: SET FRECUENCY MAPPING
es_ar: SETEAR MAPEO DE FRECUENCIAS

source: SINE
es_ar: SINUSOIDAL

source: SET MIN FREQUENCY
es_ar: SETEAR FRECUENCIA MINIMA

source: SYNTHWAVE
es_ar: ONDA SINTETIZADOR

source: FLUTE
es_ar: FLAUTA

source: PIANO
es_ar: PIA

source: ADVANCED SOUND CONFIGURATION
es_ar: CONFIGURACIÓN DE SONIDO AVANZADA

source: SOUND ENVELOPE CONFIG.
es_ar: CONFIG. DE LA ENVOLVENTE DE SONIDO

source: ATTACK
es_ar: ATAQUE

source: DECAY
es_ar: DECAIMIENTO

source: SUSTAIN
es_ar: SOSTENIMIENTO

source: RELEASE
es_ar: RELAJACIÓN

source: SET LOGARITHMIC SCALE
es_ar: SETEAR ESCALA LOGARÍTMICA

source: SET CONTINUOUS SOUND
es_ar: SETEAR SONIDO CONTINUO

source: PLOT CONFIGURATION
es_ar: CONFIGURACIÓN DEL GRÁFICO

source: GRAPH TITLE
es_ar: TÍTULO DEL GRÁFICO

source: ABSCISSA TITTLE
es_ar: TÍTULO DEL EJE ABSCISSA

source: ORDINATE TITTLE
es_ar: TÍTULO DEL EJE DE ORDENADAS

source: ADVANCED PLOT CONFIGURATION
es_ar: CONFIGURACIÓN DEL GRÁFICO AVANZADA

source: GRID OPTIONS
es_ar: OPCIONES DE LA GRILLA

source: LINE STYLE
es_ar: ESTILO DE LA LINEA

source: SOLID
es_ar: SOLIDA

source: DASH
es_ar: GUIÓN

source: DOT
es_ar: PUNTO

source: DASH-DOT
es_ar: GUIÓN-PUNTO

source: NONE
es_ar: NINGUNO

source: MARKER STYLE
es_ar: ESTILO DE MARCADOR

source: STAR
es_ar: ESTRELLA

source: CIRCLE
es_ar: CIRCULO

source: DIAMOND
es_ar: DIAMANTE

source: COLOR STYLE
es_ar: COLOR DE ESTILO

source: ORANGE
es_ar: NARANJA

source: BLUE
es_ar: AZUL

source: RED
es_ar: ROJO

source: GREEN
es_ar: VERDE

source: YELLOW
es_ar: AMARILLO

source: SENSITIVITY
es_ar: SENSIBILIDAD

source: INPUT
es_ar: ENTRADA

source: OUTPUT
es_ar: SALIDA

source: SAVE SOUND
es_ar: GUARDAR SONIDO

source: SAVE MARKERS
es_ar: GUARDAR MARCADORES

source: SAVE PLOT
es_ar: GUARDAR GRÁFICO

source: SAMPLE DATA
es_ar: DATOS DE MUESTRA

source: sine
es_ar: Sinusoidal

source: Sawtooth
es_ar: Diente de sierra

source: Triangle
es_ar: Triangular

source: Square
es_ar: Cuadrada

source: Ramp
es_ar: Rampa

source: HELP
es_ar: AYUDA

source: QUICKSTART
es_ar: GUÍA DE INICIO RÁPIDO

source: <span style="text-decoration: underline">M</span>ARK POINT
es_ar: <span style="text-decoration: underline">A</span>ÑADIR MARCADOR

source: sonoUno Web Interface
es_ar: interfaz web SonoUno

source: SonoUno is a sonification software for astronomical data presented on a table, allowing the user to configure the generated plot and some features of the sound.
es_ar: Sonouno es un software de sonificación para datos astronómicos presentados en una tabla, permitiendo al usuario configurar el gráfico generado y algunas características del sonido.

source: HOME
es_ar: INICIO

source: QUICK START
es_ar: GUÍA DE INICIO RÁPIDO

source: <input type="checkbox" [checked]="skippingLandingPage" (change)="onCheckboxChanged($event)"/> Do not show this landing page again.
es_ar: <input type="checkbox" [checked]="skippingLandingPage" (change)="onCheckboxChanged($event)"/> No volver a mostrar esta página nuevamente.

source: Quickstart Guide
es_ar: Guía de inicio rápido

source: About the sound
es_ar: Acerca del sonido

source: SonoUno counts with a default sound configuration, allowing you to load data and start playing the sonified data, if you want, you can always start twinkling around with the different values found in ‘Sound configuration’, allowing you to change the volume, minimum and maximum frequencies or the envelope filter settings.
es_ar: SonoUno cuenta con una configuración predeterminada del sonido, permitiéndote cargar los datos y comenzar a reproducir los datos sonificados, si lo deseas, siempre puedes empezar a modificar los distintos valores en "Configuración de sonido", permitiéndote cambiar el volumen, frecuencias mínimas y máximas y las propiedades del filtro envolvente.

source: About the data
es_ar: Acerca de los datos

source: To help you get started as fast as possible exploring sonoUno’s capabilities, sonoUno has a set of “Sample Data” under the ‘File’ dropdown menu. This will allow you to see how the data is processed and how the resulting screen looks like at the event of a successful data load.
es_ar: Para ayudarte a que empieces a explorar las capacidades de sonoUno tan rápido como sea posible, sonoUno cuenta con un grupo de datos de ejemplo ubicados en el menú despegable de "Datos de ejemplo". Esto te permitirá ver como los datos son procesados y como se vé el gráfico resultante al cargar exitosamente los datos.

source: About the plot
es_ar: Acerca del gráfico

source: When the page starts you should only see a blank plot and at the instant you load data it will be displayed at it. You can zoom in by clicking and dragging at a section of the graph or using the menu at the top-right corner of the plot. If you want to modify the color or the stroke of the lines, the color or shape of the markers or the tags on the plot you can do it in the ‘Plot configuration’ on the bottom right side of the page.
es_ar: Cuando la página comience deberías de poder ver un gráfico en blanco en el que al cargar los datos se representarán en el. Puedes hacer zoom en el haciendo click y arrastrando sobre la sección que quieres focalizar. Si quieres modificar el color o el estilo de las líneas, el color o la forma de los marcadores o los títulos en el gráfico lo puedes hacer en la sección "Configuración del gráfico" en la sección inferior derecha de la página.

source: About managing data
es_ar: Sobre el manejo de los datos

source: You can add your ‘.csv’ (Comma Separated File) via the ‘Browse…’ option on the ‘File’ dropdown menu. The file can have one or two columns, the first being the Abscissa axis and the second the ordinate, in the case you only provide one column with data, each value would be assigned to the ordinate and an incremental value would be assigned to the abscissa value.
es_ar: Puedes añadir tu ".csv" (Archivo separado por comas) mediante el botón "Seleccionar archivo..." en la sección input de la barra de navegación. El archivo puede tener una o dos columnas, la primera siendo la que corresponde al eje de las Abscissas y la segunda al eje de las ordenadas, en caso que solo quieras proveer una columna de datos, cada valor será asignado al eje de ordenadas y un valor incremental continuo le será asignado al eje de abscisa.

source: About the markers
es_ar: Acerca de los marcadores

source: Behind the plot you have four buttons, two very self explanatory to play and pause the reproduction of the sound, the ‘Mark point’ allows you to add markers at the point of reproduction of the data, this will be added to an array that you can download at the ‘File’ menu and the ‘Remove mark’ button that allows you to pop the last added mark point.
es_ar: Debajo del gráfico tienes cuatro botones, dos que se explican bastante bien por sí mismos, el botón de Play/Pausa y el de stop, luego está el botón de "Añadir Marcador" que te permite añadir marcadores en el punto de reproducción de los datos, estos se guardarán en una lista que se puede descargar luego desde el menú desplegable Salida, y a continuación el botón el botón de Eliminar Marcador que elimina el gráfico y de la lista el último marcador añadido.
