Repository: sonoUnoTeam/sonoUno-web
Catalog: web/src/i18n/messages.xlf
Languages: es_ar

source: Editable version for screen reader
es_ar: Versión editable para lectores de pantalla

source: D0.0 User Manual: WebVersion
es_ar: D0.0 Manual del usuario: Versión web

source: <button type="button" class="btn-sonouno ml-4"><a href="./assets/REINFORCE - D7.1 - Sonification Platform and Training Courses v1.docx" download> Download .docx</a></button>
es_ar: <button type="button" class="btn-sonouno ml-4"><a href="./assets/REINFORCE - D7.1 - Sonification Platform and Training Courses v1.docx" download> Descargar .docx</a></button>

source: Work Package
es_ar: Paquete de trabajo

source: Due Date
es_ar: Fecha de entrega

source: WP00 SonoUno: Sonification Software for astronomical data files presented in table format.
es_ar: WP00 SonoUno: Software de sonificación para variables astronómicas presentadas en formato de tabla.

source: Date
es_ar: Fecha

source: Lead Author (Org)
es_ar: Autor principal (Org)

source: Version
es_ar: Versión

source: Contributing Author(s) (Org)
es_ar: Autores contribuyentes (Org)

source: Disemination level
es_ar: Nivel de diseminación

source: Versioning and contribution history
es_ar: Versionado e historial de contribución

source: Author
es_ar: Autor

source: Notes
es_ar: Notas

source: Table of Contents (TOC)
es_ar: Tabla de contenidos (TOC)

source: Additional TOC sections
es_ar: Secciones TOC adicionales

source: Contents for Executive Summary, section 1 and 1.1
es_ar: Contenido para el resumen ejecutivo, sección 1 y 1.1

source: Contents for section 2 and2.2
es_ar: Contenidos para sección 2 y 2.2

source: Contents for sections 3, 4, 4.1-6
es_ar: Contenidos para secciones 3,4 ,4.1-6

source: Contents for section 5
es_ar: Contenidos para la sección 5

source: This document contains information which is proprietary to the REINFORCE Consortium. Neither this document nor the information contained herein shall be used, duplicated or communicated by any means to a third party, in whole or parts, except with the prior consent of the REINFORCE Consortium.
es_ar: Este documento contiene información que es propiedad del consorcio REINFORCE. Ni este documento ni la información contenida aquí podrá ser usada, duplicada, o comunicada por ningun medio a un tercero, ni en forma total ni parcial, a excepción de que se cuente con el consentimiento anterior y expreso del consorcio REINFORC.E

source: Table of contents
es_ar: Tabla de contenidos

source: 1. SOFTWARE DESCRIPTION
es_ar: 1. DESCRIPCIÓN DEL SOFTWARE

source: 2. OPENING THE SOFTWARE
es_ar: 2. ABRIENDO EL SOFTWARE

source: The other is the shortcut Shift+W.
es_ar: El otro atajo es Shift+W

source: 2.1. QUICK START GUIDE
es_ar: 2.1 GUÍA DE INICIO RÁPIDO

source: Both methods have the same results.
es_ar: Ambos métodos tienen el mismo efecto.

source: 2.2. HOME PAGE
es_ar: 2.2. PÁGINA DE INICIO

source: A way the user can store the sound from the data provided to sonoUno is the “Save Sound” feature (Image 13). T In order to save the sound, the user has to press the save sound item on the File menu
es_ar: Una manera en la que el usuario puede almacenar la información proveída a sonoUno es la funcionalidad de "Guardar Audio" (Imagen 13). Para guardar el archivo el usuario debe presionar el ítem "Guardar Audio" en el menú de "Salida"

source: 2.3. TESTING SONOUNO WEB
es_ar: 2.3 PROBANDO SONOUNO WEB

source: 2.4. THINGS TO KEEP IN MIND
es_ar: 2.4 COSAS A TENER EN CUENTA

source: The software will process the sound corresponding to the actual data displayed in the plot but with some standard sound configuration and then store it in your computer on a .wav file (image 14).
es_ar: El software va a procesar el sonido correspondiente a los datos representados en el gráfico en ese momento pero con una configuración de sonido predeterminada y procederá a guardarlo en un archivo .wav en su computadora. (Imagen 14).

source: 3.0 OPENING A FILE
es_ar: 3.0 ABRIENDO UN ARCHIVO

source: 3.1 MARK AND DELETE ALL MARKS BUTTON
es_ar: 3.1 BOTONES PARA AÑADIR Y ELIMINAR MARCADORES

source: The process to save the sound depends on the data file and can take some minutes.
es_ar: El proceso para guardar el sonido dependiendo del set de datos puede tomar algunos minutos.

source: 4. SAVE FILES
es_ar: 4.Guardar archivos

source: Before continuing with the save methods, remember that the software allows to do marks of interest on the data (Image 15), saving the coordinates inside an array, this topic is explained in the corresponding section. We mention it here because in the next lines the save marks method is described.
es_ar: Antes de continuar con los métodos de guardado, recuerde que el software le permite añadir marcadores de interés a los datos, (Imagen 15), guarda las coordenadas en una lista, este tema es explicado con más detalles en la sección correspondiente. Lo mencionamos aquí poruqe en las siguientes lineas describiremos la sección de guardar marcadores.

source: 5. EXIT THE SONOUNO
es_ar: 5. SALIR DE SONOUNO

source: 6. FUNCTIONALITIES
es_ar: 6.0 FUNCIONALIDADES

source: In order to save the values of the marks performed on the data array the user has to press the save markers item, placed on the File menu (Image 15).
es_ar: Para guardar los valores de los marcadores guardados en la lista el usuario debe de presionar el item Guardar Marcadores, ubicado en el menú de salida (Imagen 15).

source: 6.1. ABSCISSAS POSITION
es_ar: 6.1 POSICIÓN DE ABSCISAS

source: 6.2. TEMPO SELECTION
es_ar: 6.2. SELECCIÓN DE TEMPO

source: The save marks option shows a pop-up window of the file system (Image 16) that allows the user to select the directory and the name of the text file. After saving them, the marks are deleted from the sonoUno and the plot (Image 17).
es_ar: La opción de guardar marcadores muestra una ventana pop-up del explorador de archivos del sistema (Imagen 16) que permite al usuario seleccionar el directorio y el nombre del archivo de texto. Luego de guardarlos, los marcadores son borrados de sonoUno y del gráfico (Imagen 17).

source: 6.3. PLAY AND PAUSE BUTTON
es_ar: 6.3 BOTÓN DE PLAY Y PAUSA

source: 6.4. STOP BUTTON
es_ar: 6.4. BOTÓN DE STOP

source: The save markers option shows a similar pop-up window to the “save sound” feature, and then downloads the .csv file. The format of the name is the plot’s title plus “ markers.csv”.
es_ar: La opción de guardar marcadores muestra una ventana pop-up similar a la de "Guardar Audio", y luego descarga un archivo .csv. El formato del nombre es el titulo del gráfico más "markers.csv" concatenado al final.

source: 6.5. MARK POINT BUTTON
es_ar: 6.5 BOTÓN DE AÑADIR MARCADOR

source: It's important to remember that the array of markers should have at least one marker in order for this to work properly.
es_ar: Es importante recordar que el array de marcadores debe de tener al menos un marcador para que la función funcione correctamente

source: 6.6. DELETE LAST MARK BUTTON
es_ar: 6.6. Botón "Eliminar último marcador"

source: 7. PLOT AND SOUND CONFIGURATIONS
es_ar: 7. CONFIGURACIONES DEL GRÁFICO Y EL SONIDO

source: The resulting files in your downloads folders should look something like in Image 18. The original .csv file with the provided data, a .csv file with the markers and a .wav file with the sound.
es_ar: Los archivos resultantes en tu carpeta de descargas debería de verse como la Imagen 18. El .csv original con la información de entrada, un archivo .csv con los marcadores y un archivo .wav con el sonido.

source: 7.1 SOUND CONFIGURATION
es_ar: 7.1 CONFIGURACIÓN DEL SONIDO

source: 7.2. PLOT CONFIGURATIONS
es_ar: 7.2 CONFIGURACIONES DEL GRÁFICO

source: If the user opens the markers.csv file with a text editor the coordinates of that mark are going to be displayed with two columns separated by a comma corresponding to the x and y coordinates of that particular mark (Image 20).
es_ar: Si el usuario abre el archivo markers.csv con un editor de texto las coordinadas de cada marcador se mostrarán en dos columnas separadas por una coma correspondiendo la primera a X y la segunda a y de cada una de las marcas.

source: 7.2.1. STYLES OF THE DATA PLOT
es_ar: 7.2.1 ESTILOS DEL GRÁFICO DE DATOS

source: And opening the wav file is going to start playing it in the default media player of your operating system, in the image a screenshot of the mac music player.
es_ar: Al abrir el archivo .wav se comenzará la reproducción del sonido en el reproductor multimedia predeterminado de su sistema operativo, en la imagen se puede ver una captura de pantalla del reproductor predeterminado de Mac.

source: 7.2.2 MODIFYING THE TITLES.
es_ar: 7.2.2 MODIFICANDO LOS TÍTULOS.

source: 8.1 SHORTCUT KEYS-COMMENTS
es_ar: 8.1 ATAJOS DE TECLADO -COMENTARIOS

source: List of Images
es_ar: Lista de imagenes

source: 5. Exit the sonoUno
es_ar: 5.1 Salir de sonoUno

source: IMAGE 01 THE IMAGE SHOWS FIREFOX BROWSER AND THE WEB LANDING PAGE OF SONOUNO
es_ar: IMAGEN 1 LA IMAGEN MUESTRA EL NAVEGADOR FIREFOX Y LA PÁGINA WEB DE SONOUNO

source: Being web based, exiting sonoUno is as simple as closing your current tab hitting the “X” at the end of the tabs title. The default shortcut for most browsers is Ctrl+W or Cmd+W depending on your operating system, this may vary.
es_ar: Al ser basado en la web, salir de sonoUno es tan sencillo como cerrar la pestaña en la que está corriendo clickeando en la "X" ubicada a la derecha del título de la pestaña. El atajo de teclado más habitual para los navegadores es Ctrl+W, dependiendo de tu sistema operativo esto puede variar

source: IMAGE 02 THE IMAGE SHOWS FIREFOX BROWSER AND THE QUICKSTART GUIDE OF SONOUNO
es_ar: IMAGEN 02 LA IMAGEN MUESTRA EL NAVEGADOR FIREFOX Y LA GUÍA DE INICIO RÁPIDO DE SONOUNO

source: Important: Be sure to store every piece of data you want to save before closing the tab to avoid data loss.
es_ar: Importante: Asegúrate de guardar cada pieza de información que quieras preservar antes de cerrar la pestaña para evitar la perdida de datos.

source: IMAGE 03 SONOUNO HOME PAGE. PLOT AREA AND MENU.
es_ar: IMAGEN 03 LA PÁGINA DE INICIO DE SONOUNO LA SECCIÓN DEL GRÁFICO Y EL MENÚ

source: You can also quit sonoUno by closing your browser, just keep in mind that you are going to close every other tab opened at the time.
es_ar: También puedes salir de sonoUno cerrando tu navegador, solo ten en cuenta que cerrarás todas las pestañas abiertas en el momento.

source: IMAGE 04 SONOUNO HOME PAGE. PLOT AREA FUNCTIONALITIES AND ABSCISSA AND TEMPO SLIDERS. BELLOW, MATH FUNCTIONS BAR AND BELLOW THAT BAR, SOUND AND PLOT CONFIGURATION BUTTONS
es_ar: IMAGEN 04 LA PÁGINA DE INICIO DE SONOUNO, EL ÁREA DEL GRÁFICO Y LA SECCIÓN DE LAS FUNCIONALIDADES Y LOS SLIDERS DE ABSCISA Y TEMPO. DEBAJO, LA BARRA DE LAS FUNCIONES MATEMÁTICAS Y DEBAJO LOS BOTONES PARA LA CONFIGURACIÓN DEL SONIDO Y DEL GRÁFICO

source: IMAGE 05 SONOUNO HOME PAGE. SOUND FUNCTIONALITIES AND CONFIGURATIONS
es_ar: IMAGEN 05 LA PÁGINA DE INICIO DE SONOUNO. CONFIGURACIÓN DE SONIDO Y FUNCIONALIDADES

source: 6. Functionalities
es_ar: 6. Funcionalidades

source: IMAGE 06 SONOUNO HOME PAGE. PLOT FUNCTIONALITIES AND CONFIGURATIONS
es_ar: IMAGEN 06 PÁGINA DE INICIO DE SONOUNO, EL GRÁFICO, LAS FUNCIONALIDADES Y LAS CONFIGURACIONES

source: 6.1. Abscissas position
es_ar: 6.1. Posición en abscisas

source: IMAGE 07 SONOUNOWEB SAMPLE DATA MENU
es_ar: IMAGEN 07 MENÚ DE DATOS DE EJEMPLO

source: The slider of abscissa position allows the user to shift the point of data being played (Image 21). The slider shows the posicion (with a number) and also is possible to move it wuth the keyboard arrows if the mouse is on this button .
es_ar: El slider de la posición en abscissas permite al usuario cambiar el punto de los datos que está siendo reproducido (Imagen 21). El slider muestra la posición (complementado con un número). También es posible moverlo con las flechas en el teclado si en ese momento está seleccionado.

source: IMAGE 08 SHOWS THE ITEMS ON THE MENU FILE AND THE FOCUS OF THE KEYBOARD IS ON THE OPEN ITEM.
es_ar: IMAGEN 08 MUESTRA LOS ITEMS EN EL MENÚ DE ENTRADA Y EL FOCUS DEL TECLADO EN EL ITEM DE ABRIR CSV

source: IMAGE 09 POP-UP WINDOW OF THE FILE EXPLORER, SHOWN AFTER SELECTING THE ITEM.
es_ar: IMAGEN 09 POP-UP DEL EXPLORADOR DE ARCHIVOS DE TU SISTEMA OPERATIVO DESPUÉS DE SELECCIONAR UN ARCHIVO.

source: Image 21 Shows the slider, while being selected is possible to move it left and right with your keyboard arrows
es_ar: Imagen 21 Muestra el slider, mientras está seleccionado es posible moverlo hacia la izquierda o derecha con las flechas del teclado

source: IMAGE 10 THE SONOUNO FRAMEWORK WITH THE GRAPH OF THE IMPORTED DATA, IN THIS CASE A GW GLITCH.
es_ar: IMAGEN 10 EL ENTORNO DE SONOUNO CON EL GRÁFICO DE LOS DATOS IMPORTADOS, EN ESTE CASO EL ARCHIVO GLITCH

source: Image 22 As you can see the percentage of the “Abscissa Position Slider” corresponds to the position of the black line on the plot.
es_ar: Imagen 22 Como puedes observar el porcentaje del "Slider de posición en abscissas" corresponde a la posición de la línea vertical negra en el gráfico

source: IMAGE 11 SHOWS THE ITEMS ON THE MENU FILE AND THE FOCUS OF THE KEYBOARD IS ON THE OPEN ITEM.
es_ar: IMAGEN 11 MUESTRA LOS ITEMS EN EL MENÚ DE ENTRADA CON EL ITEM ABRIR CSV SELECCIONADO

source: The abscissa position can be modified before, during and after the reproduction of the data. If the reproduction is in progress, after change the reproduction continues from the new set value.
es_ar: La posición de abscisas puede ser modificada antes, durante o después de la reproducción de los datos. Si la reproducción se encuentra en progreso, al finalizar el cambio la reproducción continúa desde el nuevo valor seteado

source: IMAGE 12 POP-UP WINDOW OF THE FILE EXPLORER, SHOWN AFTER SELECTING THE ITEM.
es_ar: IMAGEN 12 LA VENTANA POP-UP DEL EXPLORADOR DE ARCHIVOS QUE SE MUESTRA LUEGO DE SELECCIONAR UN ITEM.

source: IMAGE 13 THE SONOUNO FRAMEWORK WITH THE GRAPH OF THE IMPORTED DATA FROM THE WAV FILE.
es_ar: IMAGEN 13 EL ENTORNO DE SONOUNO CON EL GRÁFICO DE LOS DATOS IMPORTADOS POR MEDIO DE UN WAV.

source: 6.2. Tempo selection
es_ar: 6.2 SELECCIÓN DE TIEMPO

source: IMAGE 14 SHOWS THE ITEMS ON THE MENU FILE.
es_ar: IMAGEN 14 MUESTRA LOS ITEMS EN EL MENÚ ENTRADA.

source: This slider controls the duration of each tone. The range goes from 0% to 100%, being 100 the shortest and 0 the longest time.
es_ar: Este slider controla la duración de cada tono. El rango va de 0% a 100%, siendo 100 el más largo y 0 el más corto.

source: IMAGE 15 POP-UP WINDOW OF THE FILE EXPLORER, SHOWN AFTER SELECTING THE ITEM.
es_ar: IMAGEN 15 LA VENTANA POP UP DEL EXPLORADOR DE ARCHIVOS, LUEGO DE SELECCIONAR UN ITEM.

source: It’s placed under the plot and to the right of the abscissa slider (Image 23). The operation is analogous to the abscissa position slider.
es_ar: Está ubicada debajo del gráfico y a la derecha del slider de posición en abscisas (Imagen 23). El método de operación es análogo al del slider de posición en abscisas

source: IMAGE 16 THE SONOUNO FRAMEWORK WITH THE GRAPH OF THE IMPORTED DATA FROM THE WAV FILE.
es_ar: IMAGEN 16 EL ENTORNO DE SONOUNO CON EL GRÁFICO DE LOS DATOS IMPORTADOS POR MEDIO DE UN WAV.

source: Image 23 The tempo slider is on the bottom right of the image.
es_ar: Image 23 El slider de tempo está en la esquina inferior derecha de la imagen.

source: IMAGE 17 DISPLAYS THE SONOUNO INTERFACE WITH AN OPENED DATA FILE, IN THE PLOT THERE IS ONE VERTICAL BLACK LINE (POSITION OF THE PLAYING COORDINATE) AND SEVERAL BLUE CIRCLES MARKING POINTS OF INTEREST ON THE GRAPH.
es_ar: IMAGEN 17 MUESTRA LA INTERFAZ DE SONOUNO CON UN ARCHIVO DE DATOS ABIERTO, EL GRÁFICO HAY UNA LÍNEA VERTICAL NEGRA (POSICIÓN DE LA COORDENADA EN REPRODUCCIÓN) Y VARIOS CÍRCULOS AZULES MARCANDO LOS PUNTOS DE INTERÉS EN EL GRÁFICO.

source: 6.3. Play and Pause button
es_ar: 6.3 Botón de Play y Pausa

source: IMAGE 18 DISPLAYS THE SONOUNO INTERFACE WITH AN OPENED DATA FILE. AT THE TOP MENU, THE OUTPUT BUTTON DISPLAYS THE SAVE SOUND, SAVE MARKERS , SAVE PLOT POSSIBILITIES.
es_ar: IMAGEN 18 MUESTRA LA INTERFAZ DE SONOUNO CON UN ARCHIVO DE DATOS ABIERTO. EN LA PARTE SUPERIOR, EL BOTÓN DE SALIDA MUESTRA LAS OPCIONES DE GUARDAR ARCHIVOS, GUARDAR MARCADORES, GUARDAR GRÁFICO.

source: It’s the first button under the graph (Image 24). When pressed, it changes its name to “Pause” and starts the reproduction of the data, the vertical black line and the abscissa position slider start to go forward, indicating the coordinates of the data being played.
es_ar: Es el primer botón debajo del gráfico (Imagen 24). Cuando se presiona, su nombre cambia a "Pausa" y comienza la reproducción de los datos, la linea vertical negra y el slider de posición de abscissas comienza a desplazarse hacia adelante, indicando las coordenadas de los datos siendo reproducidos.

source: IMAGE 19 SHOWS THE FILE MENU OPENED IN THE NAVIGATION BAR AND THE SAVE SOUND OPTION SELECTED
es_ar: IMAGEN 19 MUESTRA EL MENU DE SALIDA ABIERTO Y LA OPCIÓN DE GUARDAR AUDIO SELECCIONADA

source: IMAGE 20 SHOWS THE POP UP PANEL THAT OPENS AFTER PRESSING SAVE SOUND FOR A MAC. IF NO POP-UP IS OPENED, YOU MAY HAVE CHECKED THE AUTO DOWNLOAD OPTION ON YOUR BROWSER AND YOUR FILE SHOULD BE IN YOUR DOWNLOADS FOLDER.
es_ar: IMAGEN 20 MUESTRA EL PANEL POP-UP QUE SE ABRE AL PRESIONAR EL BOTÓN DE GUARDAR ARCHIVO. SI NO SE ABRE NINGUN POP-UP, PUEDE QUE HAYAS CHEQUEADO LA OPCIÓN DE AUTODESCARGAR ARCHIVOS EN TU NAVEGADOR, EN ESE CASO EL ARCHIVO DEBERÍA DE ESTAR EN TU CARPETA DE DESCARGAS.

source: Image 24 The play button is found on the bottom left of the image, under the graph, being the first button
es_ar: Imagen 24 El botón de play se encuentra en la esquina inferior izquierda de la imagen, debajo del gráfico, siendo el primer botón.

source: Another way to start the reproduction is with the shortcut key ”Shift+P”. This way of interacting differs from the previous two, because when pressed produces the effect directly, without modifying the keyboard focus.
es_ar: Otra manera de comenzar la reproducción es con el atajo de teclado P. Esta manera de interactuar se diferencia de las anteriores en que esta produce los efectos directamente, sin modificar el foco de la navegación por teclado.

source: IMAGE 21 SHOWS THE SAVE MARKERS OPTION FOCUSED ON THE FILE MENU.
es_ar: IMAGEN 21 MUESTRA LA OPCIÓN DE GUARDAR MARCADORES SELECCIONADA EN EL MENÚ DE SALIDA

source: IMAGE 22 POP-UP WINDOW OF THE COMPUTER FILE SYSTEM SAVING THE MARKERS CSV FILE (MAC OS)
es_ar: IMAGEN 22 MUESTRA EL POP-UP CON EL EXPLORADOR DE ARCHIVOS GUARDANDO LOS MARCADORES EN UN ARCHIVO CSV (MAC OS)

source: To pause the reproduction of the data you have to press the same button or the same shortcut key, this action maintains the vertical red line position to be able to resume it later with the play button.
es_ar: Para pausar la reproducción de los datos tienes que presionar el mismo botón o la misma tecla de acceso rápido, esta acción mantiene la linea vertical en su posición posibilitando continuar la reproducción de ese mismo punto.

source: IMAGE 23 THE INTERFACE IS SHOWN BEFORE AND AFTER CLICKING THE “SAVE MARKERS” BUTTON. THE PLAY BAR IS KEPT IN PLACE BUT MARKERS ARE ERASED AFTER SAVING THEM TO A CSV FILE (UBUNTU OS)
es_ar: IMAGEN 23 LA INTERFAZ ES MOSTRADA ANTES Y DESPUÉS DE CLICKEAR EN EL BOTÓN DE "GUARDAR MARCADORES" LA BARRA DE REPRODUCCIÓN SE MANTIENE EN EL LUGAR PERO LOS MARCADORES SON BORRADOS LUEGO DE GUARDARLOS A UN ARCHIVO CSV (UBUNTU OS)

source: IMAGE 24 DATA SAVED FROM SONOUNO WEB
es_ar: IMAGEN 24 LOS DATOS GUARDADOS DESDE SONOUNO WEB

source: 6.4. Stop button
es_ar: 6.4. BOTÓN DE STOP

source: IMAGE 25 A VIEW OF THE FILE EXPLORER AND BOTH, MARKERS AND AUDIO FILES OPENED.
es_ar: IMAGEN 25 LA VISTA DE EL EXPLORADOR DE ARCHIVOS Y LOS ARCHIVOS DE AUDIO Y MARCADORES ABIERTOS.

source: Its function is to stop the reproduction and restart the process, which means that it sets the abscissa position to zero and deletes the vertical red line from the plot (Image 25). Another way to stop the reproduction is with the shortcut key ‘Shift+S’.
es_ar: Su función es parar la reproducción y reiniciar el proceso, lo que significa que pone el indice de abscisas en cero y elimina la linea vertical roja del gráfico (Imagen 25). Otra manera de detener la reproducción es con el atajo 'Shift+S"

source: IMAGE 26 A VIEW OF THE SAVED “MARKERS.CSV” FILE
es_ar: Imagen 26 Una vista del archivo "Markers.csv" guardado

source: Image 25 The stop button is placed next to the Play button.
es_ar: Imagen 25 El botón de stop ubicado contiguo al botón de play.

source: IMAGE 27 SHOWS THE SLIDER, WHILE BEING SELECTED IS POSSIBLE TO MOVE IT LEFT AND RIGHT WITH YOUR KEYBOARD ARROWS
es_ar: Imagen 27 MUESTRA EL SLIDER, MIENTRAS ESTÁ SELECCIONADO ES POSIBLE MOVERLO HACIA LA IZQUIERDA O DERECHA CON LAS FLECHAS DEL TECLADO

source: IMAGE 28 AS YOU CAN SEE THE PERCENTAGE OF THE “ABSCISSA POSITION SLIDER” CORRESPONDS TO THE POSITION OF THE BLACK LINE ON THE PLOT.
es_ar: IMAGEN 28 COMO SE PUEDE VER EL PORCENTAJE DEL "SLIDER DE POSICIÓN DE ABSCISAS" SE RELACIONA CON LA POSICIÓN DE LA LINEA NEGRA EN EL GRÁFICO.

source: 6.5. Mark point button
es_ar: 6.5. Botón de Añadir Marcador

source: IMAGE 29 THE TEMPO SLIDER IS ON THE BOTTOM RIGHT OF THE IMAGE.
es_ar: IMAGEN 29 EL SLIDER DE TEMPO SE UBICA EN LA ESQUINA INFERIOR IZQUIERDA DE LA IMAGEN

source: This button allows the user to mark a specific point from the data. When the button is pressed sonoUno saves the current position on a vector and displays it on the graph with a symbol. (Image 26)
es_ar: Este botón le permite al usuario marcar un punto específico en los datos. Cuando el botón es presionado, sonoUno guarda la posición actual en un vector y la muestra en el gráfico con un símbolo. (Imagen 26)

source: IMAGE 30 THE PLAY BUTTON IS FOUND ON THE BOTTOM LEFT OF THE IMAGE, UNDER THE GRAPH, BEING THE FIRST BUTTON
es_ar: IMAGEN 30 EL BOTÓN DE PLAY SE ENCUENTRA EN LA ESQUINA INFERIOR IZQUIERDA DE LA IMAGEN, DEBAJO DEL GRÁFICO, SIENDO EL PRIMER BOTÓN

source: Image 26 The mark point button is found under the graph, next to the stop button.
es_ar: Imagen 26 El botón de añadir marcador se encuentra debajo del gráfico, contiguo al botón de stop.

source: IMAGE 31 THE STOP BUTTON IS PLACED NEXT TO THE PLAY BUTTON.
es_ar: IMAGEN 31 EL BOTÓN DE STOP SE ENCUENTRA CONTIGUO AL BOTÓN DE PLAY

source: In parallel, the user can mark a point on the graph with the shortcut key ‘Shift+M’. The shortcut has the same effect as pressing the button but without modifying the keyboard focus.
es_ar: En paralelo, el usuario puede marcar un punto en el gráfico con el atajo "Shift+M". El atajo tiene el mismo efecto que presionar el botón pero sin modificar el elemento enfocado.

source: IMAGE 32 THE MARK POINT BUTTON IS FOUND UNDER THE GRAPH, NEXT TO THE STOP BUTTON.
es_ar: IMAGEN 32 EL BOTÓN DE AÑADIR MARCADOR SE ENCUENTRA DEBAJO DEL GRÁFICO, CONTIGUO AL BOTÓN DE STOP

source: IMAGE 33 THE DELETE LAST MARK BUTTON IS FOUND ON THE BOTTOM RIGHT OF THE GRAPH SECTION. IT’S THE FOURTH BUTTON FROM LEFT TO RIGHT.
es_ar: IMAGEN 33 EL BOTÓN DE "ELIMINAR ULTIMO MARCADOR" SE ENCUENTRA EN LA PARTE INFERIOR DERECHA DE LA SECCIÓN DEL GRÁFICO. ES EL CUARTO BOTÓN DE IZQUIERDA A DERECHA.

source: 6.6. Delete last mark button
es_ar: 6.6. Botón "Eliminar último marcador"

source: IMAGE 34 BELOW ABSCISSA, TEMPO AND MATH SLIDERS ARE USER MODIFIABLE CONFIGURATIONS FOR SOUND AND PLOT.
es_ar: IMAGEN 34 DEBAJO LOS SLIDERS ABSCISSA, TEMPO Y MATH SON CONFIGURACIONES MODIFICABLES POR EL USUARIO PARA EL SONIDO Y EL GRÁFICO.
